app/controllers/a_controller.rb

SELECT "events".* FROM "events" WHERE (end >= '2015-04-30 13:56:34.833643')  ORDER BY start ASC
SELECT "sermons".* FROM "sermons" WHERE (end >= '2015-04-30 13:56:34.848355')  ORDER BY start ASC
SELECT "alerts".* FROM "alerts" WHERE (end >= '2015-06-12 15:30:57.352825')  ORDER BY start ASC
---
  def index
    @events = Event.where("end >= ?", DateTime.now).order("start ASC")
    @sermons = Sermon.where("end >= ?", DateTime.now).order("start ASC")
    @alerts = Alert.where("end >= ?", DateTime.now).order("start ASC")