app/controllers/alerts_controller.rb

  def index
    @alerts = Alert.order("start ASC")
---
SELECT "alerts".* FROM "alerts"  ORDER BY start ASC

  def create
    @alert = Alert.new(alert_params)

    respond_to do |format|
      if @alert.save
---
INSERT INTO "alerts" ("title", "description", "start", "end", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @alert.update(alert_params)
---
UPDATE "alerts" SET "atype" = ?, "updated_at" = ? WHERE "alerts"."id" = ?  [["atype", "danger"], ["updated_at", "2015-06-12 15:45:47.919798"], ["id", 1]]