app/controllers/events_controller.rb

  def index
    if current_user
      @events = Event.order("start ASC")
---
SELECT "events".* FROM "events" WHERE (end >= '2015-04-30 19:36:04.886183')  ORDER BY start ASC

  def create
    @event = Event.new(event_params)
    @event.start = DateTime.parse(event_params[:start])
    @event.end = DateTime.parse(event_params[:end])
    respond_to do |format|
      if @event.save
---
INSERT INTO "events" ("title", "description", "start", "end", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "url", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if event_params[:image].blank?
       event_params[:image] = @event.image
    end
    if event_params[:start].blank?
       event_params[:start] = @event.start
    end
    if event_params[:end].blank?
       event_params[:end] = @event.end
    end
    respond_to do |format|
      if @event.update(event_params)
---
UPDATE "events" SET "start" = ?, "end" = ?, "updated_at" = ? WHERE "events"."id" = ?  [["start", "1899-12-31 05:00:00.000000"], ["end", "2015-04-30 14:50:00.000000"], ["updated_at", "2015-04-30 17:54:04.482813"], ["id", 3]]