app/controllers/sermons_controller.rb

  def index
    if current_user
        @sermons = Sermon.order("start ASC")
---
SELECT "sermons".* FROM "sermons" WHERE (end >= '2015-05-12 22:13:14.815060')  ORDER BY start ASC

  def create
    @sermon = Sermon.new(sermon_params)
    @sermon.start = DateTime.parse(sermon_params[:start])
    @sermon.end = DateTime.parse(sermon_params[:end])
    respond_to do |format|
      if @sermon.save
---
INSERT INTO "sermons" ("title", "description", "start", "end", "image_file_name", "image_content_type", "image_file_size", "image_updated_at", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    if sermon_params[:image].blank?
       sermon_params[:image] = @sermon.image
    end
    if sermon_params[:start].blank?
       sermon_params[:start] = @sermon.start
    end
    if sermon_params[:end].blank?
       sermon_params[:end] = @sermon.end
    end
   respond_to do |format|
      if @sermon.update(sermon_params)
---
UPDATE "sermons" SET "image_file_name" = ?, "image_content_type" = ?, "image_file_size" = ?, "image_updated_at" = ?, "updated_at" = ? WHERE "sermons"."id" = ?